'use strict'

// // 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.
// const arr1 = ['a', 'b', 'c'];
// const arr2 = [1, 2, 3];

// const newArr1 = arr1.concat(arr2);

// console.log(newArr1);

// // 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.
// const arr3 = ['a', 'b', 'c'];

// arr3.push(1, 2, 3);

// console.log(arr3);

// // 3) Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
// const arr4 = [1, 2, 3];
// const arr5 = [4, 5, 6];

// const newArr2 = arr4.concat(arr5);

// console.log(newArr2);

// // 4) Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
// const arr6 = [1, 2, 3];

// arr6.reverse();

// console.log(arr6);

// // 5) Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// const arr7 = [1, 2, 3];

// arr7.push(5, 6, 7);

// console.log(arr7);

// // 6) Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
// const arr8 = [1, 2, 3];

// arr8.unshift(4, 5, 6);

// console.log(arr8);

// // 7)  Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
// const arr9 = ['js', 'css', 'jq'];

// //console.log(arr9.length);

// console.log(arr9[0]);

// // 8) Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
// const arr10 = ['js', 'css', 'jq'];

// //console.log(arr10.length);

// console.log(arr10[arr10.length -1]);

// // 9) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
// const arr11 = [1, 2, 3, 4, 5];

// const arr12 = arr11.slice(0, 3);

// console.log(arr12);

// // 10) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].
//             //0   1  2  3  4 5
// const arr13 = [1, 2, 3, 4, 5];

// const arr14 = arr13.slice(3, 5);

// console.log(arr14);

// // 11) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
//             //0  1  2   3  4
// const arr15 = [1, 2, 3, 4, 5];

// arr15.splice(1, 2);

// console.log(arr15);

// // 12)  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].
//             //0  1  2   3  4
// const arr16 = [1, 2, 3, 4, 5];

// const arr17 = arr16.splice(1, 3);

// console.log(arr17);

// // 13) Дан массив [1, 2, 3, 4, 5]. 
// //С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// const arr18 = [1, 2, 3, 4, 5];

// arr18.splice(3, 0, 'a', 'b', 'c');

// console.log(arr18);

// // 14) Дан массив [1, 2, 3, 4, 5]. 
// // С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// const arr19 = [1, 2, 3, 4, 5];

// arr19.splice(1, 0, 'a', 'b');
// arr19.splice(5, 0, 'c');
// arr19.splice(8, 0, 'e');

// console.log(arr19);
//------------------------------------------------------------------------------------------------------
// // 1) Выбираем случайное число (от 0 до длины массива);
// // 2) Записать в переменную обращение типа массив [индекс];
// // 3) Вывести переменную из п.2 в алерт;
// let index = Math.floor(Math.random()*animals.length);
// alert(animals[index]);
// 1) Через prompt вводим свой вариант животного
// 2) Вариант компьютера записываем в переменную
// 3) Сравниваем наш вариант з копьютером
// 3,1) Если варианти совпали, то выводим алерт "You are win!".
// 3,2) Если варианти не совпали, выводим алерт "You are los!" и вариант компьютера.

let animal = ['tiger', 'lion', 'elephant', 'cow', 'cat', 'dog', 'pig', 'snake'];
let a = Math.floor(Math.random()*animal.length);

// alert(animals[index]); 
// let b = index; 
// prompt()

// alert(b);
// if animals === index {
//     alert('You are win!');
// } else {
//     alert('You are los!' && b);
// }

// let arr = ['тигр', 'кенгуру', 'собака', 'кошка', 'свинья', 'цапля', 'дельфин' , 'медведь',' заяц', 'верблюд']
// let a = Math.round((Math.random().toFixed(2))*(arr.length-1))
// console.log('index:', a);
// let comp =arr[a];
// console.log(comp);
// let my = prompt('Enter an animal')
// if(my == comp){
//  alert('You are win!!!')
// } else {
//  alert(`You are lose - correct answer - ${comp}`)
// } 

//---------------------------------------------
// Написати гру Камінь Ножиці Папір.
// Варіанти вибору потрібно зберігати в масиві
// Користувач вводить свій варіант
// Компютер вибирає свій рандомний варівант з масиву
// Первіряємо вибір користувача і вибір компютера. 
// Опрацювати всі варіанти:
// 1) Варіанти де виграє користувач
// 2) Варіанти де виграє компютер
// 3) Варіанти де виходить нічия.


// 1) Записуємо в змінну строку з промта
// 2) Зробити строку масивом
// 3) Скопіювати масив
// 4) Реверсимо масив
// 5) З масивів робимо строки
// 6) Порівнюємо дві строки і виводимо результат в консоль; 

// let logins = ['rew', 'qwewwe', 'apple', 'js', 'row', 'col']

// 1) Запитати логін
// 2) Перевірити чи існує логін в базі
// 3) Якщо логін існує вивести алерт ("Такий логін вже існує")
// 4) Якщо логін не існує вивести алерт ("Вітаємо") 

// Collapse
// Message Input
// Message #random