'use strict'

// ___1. Зайдите в консоль своего браузера. При помощи оператора определения типа уточните тип следующих величин: 
// «Привет», 123, true, «true».

// let a = 'Привет';
// console.log(typeof a);

// let b = 123;
// console.log(typeof b);

// let c = true;
// console.log(typeof c);

// let d = "true";
// console.log(typeof d);

// ___2. Зайдите в консоль своего браузера. При помощи математических операторов (сложение, вычитание и т.д.) 
// найдите значения выражений: 5 + 3, 5 — 3, 5 * 3, 5 / 3.

// let e = 5;
// let f = 3;
// let result;
// result = e + f;
// console.log(result);

// result = e - f;
// console.log(result);

// result = e * f;
// console.log(result);

// result = e / f;
// console.log(result);

// ___3. Зайдите в консоль своего браузера. При помощи оператора нахождения остатка от деления %, 
//найдите значения выражений: 5 % 3, 3 % 5.

// let g = 5 % 3;
// console.log(g);

// let h = 3 % 5;
// console.log(h);

// ___4. Зайдите в консоль своего браузера. При помощи оператора + (сложение, склеивание) 
// найдите значения выражений: 5 + ‘3’ , ‘5’ — 3, 75 + ‘кг’.

// let j = 5 + '3';
// let k = '5' - '3';
// let l = 75 + 'кг';

// console.log(j);
// console.log(k);
// console.log(l);

// ___5. Создайте переменные строкового, числового и булева типов. Выведите их содержимое.

// let m = "5";
// let n = 5;
// let o = true;

// console.log(typeof m);
// console.log(typeof n);
// console.log(typeof o);

// ___6. Напишите скрипт, который находит площадь прямоугольника длиной 23см., шириной 10см.

// let p = 23;
// let q = 10;
// let resultPQ;

// resultPQ = p * q;
// console.log(resultPQ);

// 7. (*) Найди двенадцатый элемент последовательности Леонардо Пизанского (нужно использовать 
// функцию Math.pow(число, степень))
let n = 12;
function bine(n){
    var index = Math.pow(5, 0.5);
   
    var left = (1 + index) / 2;
    var right = (1 - index) / 2;
    
    return Math.round((Math.pow(left, n) - Math.pow(right, n)) / index);
  }
console.log(bine);

// 8. (*) Даны размер ипотечного кредита, процентная ставка, кол-во лет. Найти переплату по кредиту.

// ___9) Створіть змінну num і надайте їй значення 3. Виведіть значення цієї змінної на екран за допомогою 
// методу alert

// const num = 3;
// alert(num);

// ___10) Створіть змінні a = 10 і b = 2. Виведіть на екран їх суму, різницю, добуток і частку 
//(результат ділення)

// let r = 10;
// let s = 2;

// console.log(r + s);
// console.log(r - s);
// console.log(r * s);
// console.log(r / s);

// ___11) Створіть змінні c = 15 і d = 2. Підсумуйте їх, а результат надайте змінної result. 
// Виведіть на екран значення змінної result

// let t = 15;
// let u = 2;
// let resultTU;

// resultTU = t + u;
// console.log(resultTU);

// ___12) Створіть змінні a = 10, b = 2 і c = 5. Виведіть на екран їх суму.

// let v = 10;
// let w = 2;
// let x = 5;
// let resultVWX;

// resultVWX = v + w + x;
// console.log(resultVWX);

// 13) Створіть змінні a = 17 і b = 10. Відніміть від a змінну b і результат надайте зміннії c. 
// Потім створіть змінну d, надайте їй значення 7. Складіть змінні c і d, а результат запишіть в змінну result. 
//Виведіть на екран значення змінної result.

// let a = 17;
// let b = 10;
// let c = a - b;
// let d = 7;
// let result;

// result = a - b + d;
// console.log(result);

// 14) Запитайте ім'я користувача за допомогою методи prompt. Виведіть за допомогою alert повідомлення 'Ваше ім'я
// %значення що отримали з prompt%'

// const yourName = (prompt('what is your name?')); 
// console.log("Ваше ім'я", yourName);
// alert(yourName);

// 15) Створіть три змінні - година, хвилина, секунда. З їх допомогою виведіть поточний час в форматі 'година: хвилина: секунда'.



// 16) Створіть змінну, надайте їй число. Зведіть це число в квадрат. Виведіть його на екран

// 17) Переробіть цей код так, щоб в ньому використовувалися операції + =, - =, * =, / =. 
// Кількість рядків коду при цьому не повинно змінитися.

// var num = 47;
// num += 7;
// num -= 18;
// num *= 10;
// num /= 15;
// alert (num);

// 18) Створіть змінну str і надайте їй значення 'Hello World'. Виведіть значення цієї змінної на екран

// 19) Створіть змінні str1 = 'Hello,' і str2 = 'World!'. За допомогою цих змінних і операції додавання рядків виведіть на екран фразу 'Hello World'.

// let str1 = 'Hello';
// let str2 = 'World!';
// console.log(str[1] +str[2]);

// 20) Створіть змінну name і надайте їй ваше ім'я. Створіть змінну age і надайте їй ваш вік. Виведіть на екран 'Привіт, я  % Ім'я%!'Мені% Вік% років!'.

// 21) Створіть змінну str і надайте їй значення 'abcde'. Звертаючись до окремих символів цього рядка виведіть 
//на екран символ 'a', символ 'c', символ 'e'

// let str = 'abcde';
// console.log(str[0], str[2], str[4]);

// 22) Створіть змінну num і надайте їй значення '12345'. Знайдіть суму, різницю, добуток, частку цифр цього числа
// і виведіть ці значення в консоль

// let num = '12345';
// console.log(num[0] + num[1] + num[2] + num[3] + num[4])


// 23) Дана рядок 'js'. Зробіть з неї рядок 'JS'.

// 24) Дана рядок 'JS'. Зробіть з неї рядок 'js'

// --25) Дана рядок 'я вчу javascript!'. Знайдіть кількість символів в цьому рядку.

// var str = 'я вчу javascript!';
// console.log(str.length);

// --26) Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b.

// let a = 10;
// let b = 3;
// console.log(a % b);

// 27) Возведите 2 в 10 степень. Результат запишите в переменную st.

// 28) ___Найдите квадратный корень из 245.

// let number_28 = 245;
// console.log(Math.sqrt(number_28)); //115.652475842498529

// 29) Найдите квадратный корень из 379. Результат округлите до целых, до десятых, до сотых. (toFixed(0))

// let number_29 = 379;
// console.log(Math.round(Math.sqrt(number_29)));
// console.log(Math.sqrt(number_29));

// ___30) Найдите квадратный корень из 587. Округлите результат в большую и меньшую стороны (edited) 
// Перечень методов для работы со строками

// let number_30 = 587;
// console.log(Math.ceil(Math.sqrt(number_30)));
// console.log(Math.floor(Math.sqrt(number_30)));